{
  "Name": "Vitor Novo",
  "Role": "Software Developer",
  "Number": "(+351) 910 521 815",
  "Email": "vitorjmnovo@gmail.com",
  "Adress": "Ponte de Lima, Portugal",
  "Description": " I'm a software developer passionate about backend development and systems architecture. With Strong experience in .NET technologies, I'm driven by learning, performance, optimization, and delivering robust code.",
  "Links": [
    {
      "Url": "https://www.linkedin.com/in/vitornovo02",
      "Platform": "LinkedIn"
    },
    {
      "Url": "https://github.com/Yanko-N",
      "Platform": "GitHub"
    },
    {
      "Url": "https://vitornovo.itch.io/",
      "Platform": "Itch.io"
    }
  ],
  "Educations": [
    {
      "Course": "Informatics Engineering",
      "School": "University of Trás-os-Montes and Alto Douro",
      "Start": "2020",
      "End": "2024"
    },
    {
      "Course": "Socioeconomic Sciences Course",
      "School": "Ponte de Lima Secondary School",
      "Start": "2017",
      "End": "2020"
    }

  ],
  "Skills": [
    {
      "Name": "C#",
      "Description": "Proficient in utilizing the .NET Core environment, Windows Presentation Foundation (WPF), WinForms applications, MAUI .NET for crossPlatform, REST API's with ASP .NET Core and used ML.Net for AI integration. C# is my favourite programming language for all round development"
    },
    {
      "Name": "C++",
      "Description": "Acquired hands-on experience in the realm of 3D rendering and basic game development, contributing to a deeper understanding of graphics programming"
    },
    {
      "Name": "C",
      "Description": "Some projects made revolving around the implementation of various data structures and algorithms"
    },
    {
      "Name": "Java",
      "Description": "Engaged in hands-on exploration by developing small-scale projects, including the implementation of authentication systems utilizing file-based methods."
    },
    {
      "Name": "Python",
      "Description": "Utilized Python both in application development and data science projects, showcasing versatility and proficiency of this language"
    },
    {
      "Name": "JavaScript",
      "Description": "Developed an interactive game using Three.js, and used it for interactivity in website development for an engaging user experience."
    },

    {
      "Name": "SQL",
      "Description": "Used SQL for database design and implementation, incorporating it into various projects"
    },
    {
      "Name": "Unity",
      "Description": "Engaged in game development projects, initiating the journey for experiential learning and skill enhancement. Created interactive and engaging games, fostering hands-on experiences in game design, programming, and problem-solving."
    },
    {
      "Name": "Git",
      "Description": "Utilized version control and merging techniques for efficient project management, implementing strategies like maintaining production and development branches, committing changes, and resolving conflicts."
    }
  ],
  "Works": [
    {
      "Name": "Waiter",
      "Description": "Seasonal waiter in a Restaurant, even if it was a non engineering work, I gained valuable skills that I can bring to the table, including proficiency in multitasking and facilitating clear and responsive communication.",
      "Start": "2018",
      "End": "2023"
    },
    {
      "Name": "Software Programmer - Full Stack Developer",
      "Description": "<ul style=\"list-style:none; padding-left:0;\">\r\n <li>Developed cross-platform applications using .NET MAUI<\/li>\r\n  <li>Designed and built REST APIs with ASP.NET Core<\/li>\r\n  <li>Created and maintained back-end services<\/li>\r\n  <li>Diagnosed and resolved complex bugs and legacy issues, improving system stability and performance<\/li>\r\n  <li>Applied architectural patterns like CQRS, DDD, Mediator pattern, and Dependency Injection to improve codebase maintainability.<\/li>\r\n  <li>Integrated ML.NET models for product classification and predictive analytics.<\/li>\r\n<\/ul>\r\n",
      "Start": "2024",
      "End": "Present"
    }
  ],
  "Languages": [
    {
      "Name": "English",
      "Skill_Level": "B2"
    },
    {
      "Name": "Portuguese",
      "Skill_Level": "Native"
    }
  ]
}
